backend/app/Http/Controllers/API/v1/Products/ProductController.php

public function getFeaturedProducts()
{
    try {
        $products = Product::where('is_featured', true)
            ->with(['images' => function ($query) {
                $query->where('is_primary', true); // Fetch only primary images
            }])
            ->get(['id', 'name', 'sku', 'description', 'category']);
---
select `id`, `name`, `sku`, `description`, `category` from `products` where `is_featured` = 1 and `products`.`deleted_at` is null